[{"name":"A pleasant birthday gift","date":"2010-12-10T00:00:00.000Z","url":"2010/12/pleasant-birthday-gift.html","tags":[],"content":"Well, thanks to two of my best buddies, Prassanna Ganesh and Abhinit Kumar, I now have a website under my name.\r\n\r\nI'm a tad bit busy to do anything with it at the moment. But I'm sure to come up with something for this site, sooner or later. Until then, its just an empty cup waiting to be filled..\r\n\r\nAnd cheers to all my MIT 2007 batch-mates! 4 Unforgettable years of our lives! For all that we know, could be the best in many ways. Nevertheless, here's to a more exciting future and an incredible journey ahead! Cheers!\r\n\r\nThanks again to Abhinit and RPG."},{"name":"And I blog!","date":"2011-12-07T00:00:00.000Z","url":"2011/12/after-years-of-contemplation-today.html","tags":[],"content":"After years of contemplation, today, the thought struck me. May it be the tiny little scripts, softwares tests or personal reviews, or a project that I work on, its great to learn, but I must make time to share what I learn! Well, if it wasn't for all those tutorials and blogs that ended up in my Google results years ago, I probably wouldn't have learnt what I have. My primary source of knowledge was the internet since my childhood. I was one of those kids - \"Mom, why are these books clogging up our home?, we have Internet!\", \"Mom, why do you want to go to the railway station for a simple ticket? we have Internet!\", \"Grandpa, why do you keep tuning that radio, we have Internet!\". Well, gone "},{"name":"Automate your TV show downloads","date":"2011-12-29T00:00:00.000Z","url":"2011/12/automate-your-tv-show-downloads.html","tags":[],"content":"So, I've become quite a TV show addict lately. I found myself checking websites for new episodes often, and if available, download and add it to my Torrents download list. The same exact process. Should write a short program to do that, I thought. But never happened.\r\n\r\nAnd it all changed recently, as I had sat down for food waiting for my order. I had just discovered Scripting for Android a while back - I was able to write and run Python code off my phone. Pretty cool. And I happened to overhear a conversation about the latest episode of House. Hmmm.\r\n\r\nAnd so I started typing out a script to check for TV shows. By the time lunch arrived, I had already written the part to search my phone fo"},{"name":"Motorola Defy - Upgrade/Downgrade kernels","date":"2012-03-18T00:00:00.000Z","title":null,"url":"2012/03/motorola-defy-upgradedowngrade-kernels.html","tags":[],"content":"Motorola has a unique way to controlling their phone. They release an update which prevents us from upgrading to newer kernels released for the same phone in different geographic regions. So, after almost bricking my phone, I finally was able to find a way to downgrade my kernel, so that I can upgrade to an even newer version again.\r\n\r\n**So, here's my post regarding the same on XDA:**\r\n\r\nPeople who are stuck with 4.5.1-134_DFP-13XX Kernels and or any BL6 SBFs on the Motorola Defy(+) may now freely switch between any kernels they require, using the below SBF.\r\n\r\nSay for example, to upgrade to Walter's fixed SBF of 4.5.3_109 Kernel from 4.5.1-134_DFP-13XX, do the following.\r\n\r\n1. Flash Defy-BL"},{"name":"PVL-StockPlus - Custom ROM for Motorola Defy Plus","date":"2012-04-05T00:00:00.000Z","url":"2012/04/pvl-stockplus-custom-rom-for-motorola_05.html","tags":[],"content":"So, after staying at CM for a long time, I came across the recent release of Motorola's ROM. And I must admit, for the first time, I was quite impressed. It was snappy, fast and stable. So, I guess I came to a point where I wanted everything to just work instead of hovering around nightlies, making this stock version a perfect base to rectify Motorola's shortcomings, like the God-awful transitions, the complex and ugly loading icon, and well, root, busybox, memory optimizations and all the other performance goodies. I'm a fan of keeping things simple and elegant, rather than complicating things unnecessarily. And I thought, I would share it this time, for those who prefer to use a stable sto"},{"name":"MongoDB Session State Provider for ASP.NET","date":"2013-02-22T00:00:00.000Z","url":"2013/02/mongodb-session-state-provider-for.html","tags":[],"content":"I've been pretty impressed with the recent development of MongoDB, and it seems to me that their one biggest problem of data consistency has now been solved.\r\n\r\nAnd so, I decided to give it base one of our upcoming projects fully on MongoDB. But after some Googling I found out all the session providers out there are pretty outdated using deprecated libraries, or not suited for high-performance needs.\r\n\r\nSo, here's a session provider for ASP.NET.\r\n\r\n**Installation:**\r\n> PM> Install-Package PVL.MongoSessionProvider\r\n\r\n**NuGet Pacakge Link:** [https://nuget.org/packages/PVL.MongoSessionProvider/](https://nuget.org/packages/PVL.MongoSessionProvider/)\r\n**Code:** [https://github.com/prasannavl/Mon"},{"name":"Javascript locks","date":"2013-04-27T00:00:00.000Z","url":"2013/04/javascript-locks.html","tags":[],"content":"> <span style=\"color: #e06666;\">**Note:** This was written when the javascript ecosystem was in a whole different era. This article is here only for historical reasons. **Do not ever do this**, unless you know what you're doing. Also note that this is more of a task library than just for locking - this was a way to solve a particular problem I was facing. That being said, this is almost always a wrong approach for any problem in today's world. :)</span>\r\n\r\nThings break. Codes break. Javascript - they don't just break, they break everything along with it. Being the simplest language has its downsides. But one of the common reasons that happen is people tend to forget that everything in JS is "}]